#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lsy/gitops-demo-2/runs/run-CCsbSiyq6Zsnh21i

Waiting for the plan to start...

Terraform v0.12.30
Configuring remote state backend...
Initializing Terraform configuration...
2021/03/29 14:28:16 [DEBUG] Using modified User-Agent: Terraform/0.12.30 TFC/955fd3a444
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_public_ip.lb-pip will be created
  + resource "azurerm_public_ip" "lb-pip" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "westeurope"
      + name                         = "lb-pip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "demo-rg"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "demo-rg"
      + tags     = (known after apply)
    }

  # module.avset.azurerm_availability_set.availability_set will be created
  + resource "azurerm_availability_set" "availability_set" {
      + id                           = (known after apply)
      + location                     = "westeurope"
      + managed                      = true
      + name                         = "app_server_avset"
      + platform_fault_domain_count  = 2
      + platform_update_domain_count = 2
      + resource_group_name          = "demo-rg"
      + tags                         = (known after apply)
    }

  # module.loadbalancer.azurerm_lb.load_balancer will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "westeurope"
      + name                 = "APP_LOAD_BALANCER"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "demo-rg"
      + sku                  = "Basic"
      + tags                 = (known after apply)

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "loadbalancerFE"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # module.loadbalancer.azurerm_lb_backend_address_pool.backend_pool will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "BackendPool"
      + resource_group_name       = "demo-rg"
    }

  # module.loadbalancer.azurerm_lb_probe.lb_probes[0] will be created
  + resource "azurerm_lb_probe" "lb_probes" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "tcp80"
      + number_of_probes    = 2
      + port                = 80
      + protocol            = "tcp"
      + resource_group_name = "demo-rg"
    }

  # module.loadbalancer.azurerm_lb_rule.lb_rules[0] will be created
  + resource "azurerm_lb_rule" "lb_rules" {
      + backend_address_pool_id        = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "loadbalancerFE"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "rule_0"
      + probe_id                       = (known after apply)
      + protocol                       = "tcp"
      + resource_group_name            = "demo-rg"
    }

  # module.vm_apps.data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            ${ansvars}
            ${group}
            ${servers}
        EOT
      + vars     = {
          + "ansvars" = <<~EOT
                [app_servers:vars]
                ansible_user = jedi
            EOT
          + "group"   = "[app_servers]"
          + "servers" = (known after apply)
        }
    }

  # module.vm_apps.azurerm_network_interface.vm_nix[0] will be created
  + resource "azurerm_network_interface" "vm_nix" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "demovmapp_nic1"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "demo-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "demovmapp_ipconf1"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.vm_apps.azurerm_network_interface.vm_nix[1] will be created
  + resource "azurerm_network_interface" "vm_nix" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "demovmapp_nic2"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "demo-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "demovmapp_ipconf2"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.vm_apps.azurerm_public_ip.vm-pip[0] will be created
  + resource "azurerm_public_ip" "vm-pip" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "westeurope"
      + name                         = "vm-pip1"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "demo-rg"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.vm_apps.azurerm_public_ip.vm-pip[1] will be created
  + resource "azurerm_public_ip" "vm-pip" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "westeurope"
      + name                         = "vm-pip2"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "demo-rg"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.vm_apps.azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefix                                 = "10.0.2.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "demo-rg"
      + virtual_network_name                           = "example-network"
    }

  # module.vm_apps.azurerm_virtual_machine.vm[0] will be created
  + resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "westeurope"
      + name                             = "demovmapp01"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "demo-rg"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1s"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "jedi"
          + computer_name  = "demovmapp01"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC0mWt2+WDL7xhv3jP6J+rb/eYBrRkYPFw9mVMoaCme0GB6YivQItfTtrtqcMcAOlF0BVvNFSIaDnVPX4zy7svy7NHcbMJkf2DEFZip3QijArQQRdq1fLWvYyNh6m/MBPrLDOeXDLzw+PI9mZpAAtfAsoJltSk396M9cv3Ae/79BuRiutjc8YTocAabrPG+yG+IjB/Dv3mqe6rDZNWyh3NhiNCFZ7a+pHI5RJA+RURNWgDR4rKr53p1/XNmCAqDY2rD1DVck/gvhw72R1pVucHYdVVpwGdAtvMhGKC/eVxu+8vfW9lopSuZ7WryAU0H014kKXy7SZSZs9xrTB/KlMR5/kJRW/8MIrgA8ltPnBhE1ouH0HxfImOlph9upDcOkqAGrLxiphYG9phtR7nu4yZ1jWqICFA7+2sWJF1f8rtYcneD58EcwUnJ8wMB/DLxJiEaWlog2beKRhZsZ/2d5J9XFJv7SZLdSECONAu+YT5ZE+Mi6y5hThdP2LuRmt0n4aE="
              + path     = "/home/jedi/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "CentOS"
          + publisher = "OpenLogic"
          + sku       = "7.6"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "demovmapp_disk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm_apps.azurerm_virtual_machine.vm[1] will be created
  + resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "westeurope"
      + name                             = "demovmapp02"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "demo-rg"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1s"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "jedi"
          + computer_name  = "demovmapp02"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC0mWt2+WDL7xhv3jP6J+rb/eYBrRkYPFw9mVMoaCme0GB6YivQItfTtrtqcMcAOlF0BVvNFSIaDnVPX4zy7svy7NHcbMJkf2DEFZip3QijArQQRdq1fLWvYyNh6m/MBPrLDOeXDLzw+PI9mZpAAtfAsoJltSk396M9cv3Ae/79BuRiutjc8YTocAabrPG+yG+IjB/Dv3mqe6rDZNWyh3NhiNCFZ7a+pHI5RJA+RURNWgDR4rKr53p1/XNmCAqDY2rD1DVck/gvhw72R1pVucHYdVVpwGdAtvMhGKC/eVxu+8vfW9lopSuZ7WryAU0H014kKXy7SZSZs9xrTB/KlMR5/kJRW/8MIrgA8ltPnBhE1ouH0HxfImOlph9upDcOkqAGrLxiphYG9phtR7nu4yZ1jWqICFA7+2sWJF1f8rtYcneD58EcwUnJ8wMB/DLxJiEaWlog2beKRhZsZ/2d5J9XFJv7SZLdSECONAu+YT5ZE+Mi6y5hThdP2LuRmt0n4aE="
              + path     = "/home/jedi/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "CentOS"
          + publisher = "OpenLogic"
          + sku       = "7.6"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "demovmapp_disk2"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm_apps.azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-network"
      + resource_group_name = "demo-rg"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.vm_apps.null_resource.ansible will be created
  + resource "null_resource" "ansible" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @waxb, Action: `pull_request`*